src/Catalogs/ШаблоныПечатныхДокументов/ШаблоныПечатныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныПечатныхДокументов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Групповой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Внешний</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерСтраницы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаСтраницы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаСтраницы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРядов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьQRКод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолеСлева</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолеСправа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолеСверху</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолеСнизу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПринтерДляПерепрогона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ШаблоныПечатныхДокументов/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
    Попытка
    КОМОбъект = Новый COMОбъект ("WScript.Network");
    Принтеры = КОМОбъект.EnumPrinterConnections();
    к = 0;
        Пока к < Принтеры.Count()-1 Цикл
        СписокПринтеров.Добавить(Принтеры.Item(к+1), Принтеры.Item(к+1));
        к = к + 2;
        КонецЦикла;
    Исключение
    Сообщить(ОписаниеОшибки());
    КонецПопытки;
		Если Объект.РазмерСтраницы = "Custom" Тогда
		Элементы.ВысотаСтраницы.Доступность = Истина;
		Элементы.ШиринаСтраницы.Доступность = Истина;
		Иначе	
		Элементы.ВысотаСтраницы.Доступность = Ложь;
		Элементы.ШиринаСтраницы.Доступность = Ложь;	
		КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокШаблонов()
СписокШаблонов = Новый СписокЗначений;

	Для к = 0 по Метаданные.ОбщиеМакеты.Количество()-1 Цикл
	СписокШаблонов.Добавить(СтрЗаменить(Метаданные.ОбщиеМакеты.Получить(к).ПолноеИмя(),"ОбщийМакет.",""),Метаданные.ОбщиеМакеты.Получить(к).Синоним);
	КонецЦикла;
Возврат(СписокШаблонов);
КонецФункции
 
&НаСервере
Функция ПолучитьКаталогДокументовИПрограмм();
Возврат(Константы.КаталогДокументовИПрограмм.Получить());	
КонецФункции

&НаКлиенте
Процедура ШаблонНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
СписокШаблонов = ПолучитьСписокШаблонов();
	Если Объект.Внешний Тогда
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);

	Диалог.Заголовок = "Выберите шаблон печати";
	Диалог.ПолноеИмяФайла = ""; 
	Фильтр = "MXL-файл (*.mxl)|*.mxl"; 
	Диалог.Фильтр = Фильтр; 
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Каталог = ПолучитьКаталогДокументовИПрограмм()+"532 (Паспорта)\Шаблоны\";
		Если Диалог.Выбрать() Тогда
		Файл = Новый Файл(Диалог.ВыбранныеФайлы[0]);

		Объект.Шаблон = Файл.Имя; 
		Объект.Наименование = Файл.ИмяБезРасширения;
		КонецЕсли; 	
	Иначе	
	Выбор = "";
	Выбор = СписокШаблонов.ВыбратьЭлемент("Выберите шаблон",Выбор);
		Если Выбор <> Неопределено Тогда
		Объект.Шаблон = Выбор.Значение;
		Объект.Наименование = Выбор.Представление;
		КонецЕсли;	
	КонецЕсли;  
КонецПроцедуры

&НаКлиенте
Процедура РазмерСтраницыПриИзменении(Элемент)
	Если Объект.РазмерСтраницы = "Custom" Тогда
	Элементы.ВысотаСтраницы.Доступность = Истина;
	Элементы.ШиринаСтраницы.Доступность = Истина;
	Иначе	
	Элементы.ВысотаСтраницы.Доступность = Ложь;
	Элементы.ШиринаСтраницы.Доступность = Ложь;
	Объект.ВысотаСтраницы = 0;
	Объект.ШиринаСтраницы = 0;	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПринтерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
ЭлементСписка = СписокПринтеров.ВыбратьЭлемент("Выберите принтер",ЭлементСписка);
ПринтерОбработкаВыбора(Элемент, ЭлементСписка.Значение, Истина);  
КонецПроцедуры

&НаКлиенте
Процедура ПринтерОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
Объект.ПринтерДляПерепрогона = ВыбранноеЗначение;
КонецПроцедуры
